; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 10635)
	(= (fuel plane1) 3642)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at plane2 city3)
	(= (capacity plane2) 8582)
	(= (fuel plane2) 1186)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 9)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at plane3 city3)
	(= (capacity plane3) 5747)
	(= (fuel plane3) 788)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at plane4 city3)
	(= (capacity plane4) 8690)
	(= (fuel plane4) 3828)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 9)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at person1 city0)
	(at person2 city4)
	(at person3 city4)
	(at person4 city3)
	(at person5 city3)
	(at person6 city2)
	(at person7 city4)
	(at person8 city0)
	(at person9 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 582)
	(= (distance city0 city2) 851)
	(= (distance city0 city3) 734)
	(= (distance city0 city4) 767)
	(= (distance city1 city0) 582)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 639)
	(= (distance city1 city3) 968)
	(= (distance city1 city4) 772)
	(= (distance city2 city0) 851)
	(= (distance city2 city1) 639)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 920)
	(= (distance city2 city4) 939)
	(= (distance city3 city0) 734)
	(= (distance city3 city1) 968)
	(= (distance city3 city2) 920)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 958)
	(= (distance city4 city0) 767)
	(= (distance city4 city1) 772)
	(= (distance city4 city2) 939)
	(= (distance city4 city3) 958)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city0)
	(at person3 city0)
	(at person4 city2)
	(at person5 city4)
	(at person6 city1)
	(at person7 city1)
	(at person8 city0)
	(at person9 city0)
	))

(:metric minimize (+ (* 4 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane4 city3)
   changed: (fuel plane4) from 3828 to 8690
   goals met: 2 of 9
2. (board person5 plane4 city3)
   deleted: (at person5 city3)
   added: (in person5 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 2 of 9
3. (fly plane4 city3 city0)
   deleted: (at plane4 city3)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 0 to 2936, (fuel plane4) from 8690 to 5754
   goals met: 2 of 9
4. (board person1 plane4 city0)
   deleted: (at person1 city0)
   added: (in person1 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 2 of 9
5. (board person4 plane2 city3)
   deleted: (at person4 city3)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 9
6. (fly plane4 city0 city1)
   deleted: (at plane4 city0)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 2936 to 5264, (fuel plane4) from 5754 to 3426
   goals met: 2 of 9
7. (refuel plane2 city3)
   changed: (fuel plane2) from 1186 to 8582
   goals met: 2 of 9
8. (zoom plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 5264 to 13544, (fuel plane2) from 8582 to 302
   goals met: 2 of 9
9. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 9
10. (fly plane4 city1 city4)
   deleted: (at plane4 city1)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 13544 to 16632, (fuel plane4) from 3426 to 338
   goals met: 3 of 9
11. (debark person5 plane4 city4)
   deleted: (in person5 plane4)
   added: (at person5 city4)
   changed: (onboard plane4) from 2 to 1
   goals met: 4 of 9
12. (debark person1 plane4 city4)
   deleted: (in person1 plane4)
   added: (at person1 city4)
   changed: (onboard plane4) from 1 to 0
   goals met: 5 of 9
13. (board person2 plane4 city4)
   deleted: (at person2 city4)
   added: (in person2 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 5 of 9
14. (board person3 plane4 city4)
   deleted: (at person3 city4)
   added: (in person3 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 5 of 9
15. (board person7 plane4 city4)
   deleted: (at person7 city4)
   added: (in person7 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 5 of 9
16. (refuel plane4 city4)
   changed: (fuel plane4) from 338 to 8690
   goals met: 5 of 9
17. (fly plane4 city4 city0)
   deleted: (at plane4 city4)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 16632 to 19700, (fuel plane4) from 8690 to 5622
   goals met: 5 of 9
18. (debark person2 plane4 city0)
   deleted: (in person2 plane4)
   added: (at person2 city0)
   changed: (onboard plane4) from 3 to 2
   goals met: 6 of 9
19. (debark person3 plane4 city0)
   deleted: (in person3 plane4)
   added: (at person3 city0)
   changed: (onboard plane4) from 2 to 1
   goals met: 7 of 9
20. (zoom plane4 city0 city1)
   deleted: (at plane4 city0)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 19700 to 24938, (fuel plane4) from 5622 to 384
   goals met: 7 of 9
21. (debark person7 plane4 city1)
   deleted: (in person7 plane4)
   added: (at person7 city1)
   changed: (onboard plane4) from 1 to 0
   goals met: 8 of 9
22. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 24938 to 28133, (fuel plane1) from 3642 to 447
   goals met: 8 of 9
23. (refuel plane2 city2)
   changed: (fuel plane2) from 302 to 8582
   goals met: 8 of 9
24. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 8 of 9
25. (fly plane2 city2 city1)
   deleted: (at plane2 city2)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 28133 to 30050, (fuel plane2) from 8582 to 6665
   goals met: 8 of 9
26. (debark person6 plane2 city1)
   deleted: (in person6 plane2)
   added: (at person6 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 9 of 9
